{"modelTopology": {"keras_version": "2.2.0", "backend": "tensorflow", "model_config": {"config": [{"config": {"name": "embedding_1", "embeddings_constraint": null, "input_length": 300, "mask_zero": false, "dtype": "float32", "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "trainable": true, "output_dim": 256, "batch_input_shape": [null, 300], "input_dim": 20000, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "bidirectional_1", "trainable": true, "layer": {"config": {"kernel_regularizer": null, "stateful": false, "units": 128, "dropout": 0.0, "return_state": false, "trainable": true, "unroll": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "use_bias": true, "name": "lstm_1", "recurrent_regularizer": null, "bias_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"name": "conv1d_1", "activity_regularizer": null, "padding": "valid", "filters": 64, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1], "activation": "linear", "strides": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.1, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "activity_regularizer": null, "units": 50, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.1, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "units": 6, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"optimizer_config": {"config": {"amsgrad": false, "lr": 0.0010000000474974513, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0}, "class_name": "Adam"}, "loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of6", "group1-shard2of6", "group1-shard3of6", "group1-shard4of6", "group1-shard5of6", "group1-shard6of6"], "weights": [{"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [3, 256, 64], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [64, 50], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [50, 6], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [6], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [20000, 256], "dtype": "float32"}]}]}